Revit 2015 API
AreaLoadTypeSet.Insert Method
Insert the specified areaload type into the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	AreaLoadType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As AreaLoadType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	AreaLoadType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Structure.AreaLoadType
The areaload type to be inserted into the set.
Return Value
Returns whether the areaload type was inserted into the set.
See Also
AreaLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace